Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1012SG00064.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CoreDebug</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Debug Control Block</description>
         <baseAddress>0xE000EDF0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DHCSR</name>
               <description>Debug Halting Control and Status Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>C_DEBUGEN</name>
                     <description>Enable Halting debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C_HALT</name>
                     <description>Halt processor</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C_STEP</name>
                     <description>Enable single step</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C_MASKINTS</name>
                     <description>Mask PendSV, SysTick and external configurable interrupts</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_SNAPSTALL</name>
                     <description>Snap stall control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_REGRDY</name>
                     <description>Register ready status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_HALT</name>
                     <description>Halted status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_SLEEP</name>
                     <description>Sleeping status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_LOCKUP</name>
                     <description>Lockup status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_SDE</name>
                     <description>Secure debug enabled</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_RETIRE_ST</name>
                     <description>Retire sticky status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_RESET_ST</name>
                     <description>Reset sticky status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S_RESTART_ST</name>
                     <description>Restart sticky status</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCRSR</name>
               <description>Debug Core Register Select Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>REGSEL</name>
                     <description>Register selector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>REGWnR</name>
                     <description>Register write/not-read access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCRDR</name>
               <description>Debug Core Register Data Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DBGTMP</name>
                     <description>Data temporary buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEMCR</name>
               <description>Debug Exception and Monitor Control Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VC_CORERESET</name>
                     <description>Core reset Halting debug vector catch enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_MMERR</name>
                     <description>MemManage exception Halting debug vector catch enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_NOCPERR</name>
                     <description>UsageFault exception coprocessor access Halting debug vector catch enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_CHKERR</name>
                     <description>UsageFault exception checking error Halting debug vector catch enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_STATERR</name>
                     <description>UsageFault exception state information error Halting debug vector catch enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_BUSERR</name>
                     <description>BusFault exception Halting debug vector catch enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_INTERR</name>
                     <description>Excception entry and return faults Halting debug vector catch enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_HARDERR</name>
                     <description>HardFault exception Halting debug vector catch enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VC_SFERR</name>
                     <description>SecureFault exception Halting debug vector catch enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_EN</name>
                     <description>DebugMonitor enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_PEND</name>
                     <description>DebugMonitor pending state</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_STEP</name>
                     <description>Enable DebugMonitor stepping</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON_REQ</name>
                     <description>DebugMonitor semaphore bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDME</name>
                     <description>Secure DebugMonitor enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRCENA</name>
                     <description>Global DWT and ITM features enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAUTHCTRL</name>
               <description>Debug Authentication Control Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SPIDENSEL</name>
                     <description>Secure invasive debug enable select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTSPIDEN</name>
                     <description>Internal Secure invasive debug enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPNIDENSEL</name>
                     <description>Secure non-invasive debug enable select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTSPNIDEN</name>
                     <description>Internal Secure non-invasive debug enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSCSR</name>
               <description>Debug Security Control and Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SBRSELEN</name>
                     <description>Secure Banked register select enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SBRSEL</name>
                     <description>Secure Banked register select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDS</name>
                     <description>Current domain Secure</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDSKEY</name>
                     <description>CDS field write-enable key</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
