Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1012SG00064.svd
            <cluster>
               <dim>32</dim>
               <dimIncrement>0x8</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x020</addressOffset>
               <register>
                  <name>CHANNEL</name>
                  <description>Channel n Control</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00008000</resetValue>
                  <fields>
                     <field>
                        <name>EVGEN</name>
                        <description>Event Generator Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>PATH</name>
                        <description>Path Selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PATHSelect</name>
                           <enumeratedValue>
                              <name>ASYNCHRONOUS</name>
                              <description>Asynchronous path</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESYNCHRONIZED</name>
                              <description>Resynchronized path</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EDGSEL</name>
                        <description>Edge Detection Selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EDGSELSelect</name>
                           <enumeratedValue>
                              <name>NO_EVT_OUTPUT</name>
                              <description>No event output when using the resynchronized or synchronous path</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING_EDGE</name>
                              <description>Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING_EDGE</name>
                              <description>Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BOTH_EDGES</name>
                              <description>Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in standby</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONDEMAND</name>
                        <description>Generic Clock On Demand</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENCLR</name>
                  <description>Channel n Interrupt Enable Clear</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVR</name>
                        <description>Channel Overrun Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVD</name>
                        <description>Channel Event Detected Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENSET</name>
                  <description>Channel n Interrupt Enable Set</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVR</name>
                        <description>Channel Overrun Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVD</name>
                        <description>Channel Event Detected Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTFLAG</name>
                  <description>Channel n Interrupt Flag Status and Clear</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>OVR</name>
                        <description>Channel Overrun</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVD</name>
                        <description>Channel Event Detected</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSTATUS</name>
                  <description>Channel n Status</description>
                  <addressOffset>0x7</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>RDYUSR</name>
                        <description>Ready User</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSYCH</name>
                        <description>Busy Channel</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>104</dim>
               <dimIncrement>1</dimIncrement>
               <name>USER[%s]</name>
               <description>User Multiplexer n</description>
               <addressOffset>0x120</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL</name>
                     <description>Channel Event Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
